[
        {
            "name": "All-or-nothing thinking",
            "intro": "\nDoes it assume all-or-nothing thinking or thinking only in extremes?\n",
            "opening": "\nWhen thinking in all-or-nothing terms, \nyou split your views into extremes.\nEverything—from your view of yourself\nto your life experiences is divided into black-or-white terms.\nThis leaves room for little, if any, gray area in between.\n",
            "example": "\nFor example: statement such as 'I am bad at making friends'\n",
            "affirmation": "\nNice catch! Sometimes even knowing that our thoughts are biased helps.\n",
            "explanation": "\nThis type of faulty thinking can include \nan inability to see the alternatives in a situation.\nFor people with anxiety or depression, this often means \nonly seeing the downside to any given situation.\nPeople who fall victim to all-or-nothing thinking\nbelieve that they're either successful or a complete failure in life.\n",
            "exercise": "\nThis is the best part. \nCan you rewrite the thought in a way that this bias is fixed.\nMaking it a more balanced statement\nrather than black-and-white.\nFor ex. I am bad at making friends can be rewritten as: \nAs I moved to a new place, I am facing some difficulties to make friends for now.\n"
        },
        {
            "name": "Mind-reading or Jumping to conculusion",
            "intro": "\nDoes this thought assume knowing what others are thinking?\n",
            "opening": "\nWith the ‘mind reading’ distortion we assume \nthat other people are thinking negatively about us.\nAnd we arbitrarily jump to a negative conclusion \nthat is not justified by the facts”.\n",
            "example": "\nFor example: He is ignoring me so he must not like me anymore\n",
            "affirmation": "\nWow, this is usually difficult to catch. Good job.\n",
            "explanation": "\nTo some extent these are natural processes \n– who hasn’t had the experience of thinking that \na disaster has befallen a loved one who is late home from work?\nBut taken to extremes, as is often the case in depression and anxiety, \nthese can be extremely destructive biases.\n",
            "exercise": "\nTo question this bias, let's do an exercise:\nCan you rate the degree of your belief. How sure of this are you? \nIf its low then you know its not correct. \nAnd if it is high, can you do something about it?\n"
        },
        {
            "name": "Should Statements",
            "intro": "\nDoes this thought contain a should/must/ought to statement?\n",
            "opening": "\nThe 'should-statement' distortion imply \nthat we ought to be better or different somehow.\n",
            "example": "\nFor example: I am an adult, I should have my life in order\n",
            "affirmation": "\nNoticing should-statement is a great start\n",
            "explanation": "\nShould statements are a common negative thinking pattern\nthat can contribute to feelings of fear and worry.\nThey also put unreasonable demands and pressure on ourselves\nwhich can make us feel guilty or like we've failed.\n",
            "exercise": "\nExamine the evidence for and against the statement,\nand then write a new statement\nthat is more realistic and positive.\nfor example: I should have my life in order\n can be rewrittnen as\nI am trying my best to get my life in order.\n"
        },
        {
            "name": "Over-generalization",
            "intro": "\nDoes your thought assume a never-ending pattern of defeat?\n",
            "opening": "\nWhen you overgeneralize we assume\none negative event in life as a never ending pattern.\nWe may say or feel things like,\n“nothing good ever happens to me” or\n“everything is always terrible.\n",
            "example": "\nFor example: I will never get a job.\n",
            "affirmation": "\nThat's a great first step\n",
            "explanation": "\nIt is the process of arbitrarily concluding\nthat “one thing that happened to you once\nwill occur over and over again.\n",
            "exercise": "\nOften it can help to think of a time\nwhen you felt things weren’t going your way.\nDid things change? Did things get better?\nUnderstanding that while you may be in a negative situation,\nyour life hasn’t “always” been this way\nIt may help you see the light you need to move forward.\n"
        },
        {
            "name":"Labeling and mislabeling",
            "intro":"\nDoes your thought has a negative label that applies to you?\n",
            "opening": "\nLabelling generalizes by taking\none characteristic of a person, and applying it to the whole person\n",
            "example":"\nFor example: I failed a test, so I must be a 'failure'\n",
            "affirmation":"\nIdentifying these labels is as important as correcting them\n",
            "explanation":"\nLabelling means creating a complex,\nnegative self-image based on your errors.\nIn addition to causing inaccurate thinking,\nit can fuel and maintain painful emotions\n",
            "exercise":"\nTrick your thoughts to take the language of a loved one.\nThink about what a good friend\nor a loved one will say to you.\nFor example: I failed a test becasue I might not be well-prepared\nand I can control my preparation.\nSo I will work harder.\n"
        },
        {
            "name":"Magnification and Minimization",
            "intro":"\nDoes your thought inflate the negative or downplay the positive?\n",
            "opening": "\nMagnification and minimization is seen as a ‘binocular trick’\nbecause of the way that errors, fears, or imperfections are exaggerated\nwhile strengths and achievements are made to seem small and unimportant\n",
            "example":"\nFor example: After giving a good presentation you remember and replay\nonly the mistakes you made and took the positives for granted.\n",
            "affirmation":"\nNice catch!\n",
            "explanation":"\nPeople who tend to discount the positive\ndon’t ignore or overlook something positive.\nInstead, they explain it away as a fluke or sheer luck.\nAccepting only negative perspective of yourselfand your future\ncan cause feelings of hopelessness.\n",
            "exercise":"\nAlways remember, things are not black-and-white.\nThere is good and bad in everything.\nTry looking at the good and the bad.\n"
        },
        {
            "name":"Personalization",
            "intro":"\nDoes this thought assumes that\nyou’ve been intentionally excluded or targeted.\n",
            "opening": "\nPersonalization is one of the most common errors in thinking\nIt is taking things personally when\nthey’re not connected to or caused by you at all\n",
            "example":"\nFor example: Your child has an accident, and\nyou blame yourself for allowing them to go to that party\n",
            "affirmation":"\nGood job. Its a tough one to recognize\n",
            "explanation":"\nPersonalization occurs when we perceive negative,\nexternal events are our responsibility,\neven if there is no proof of the connection.\nFeeling responsible for another person’s happiness,\n and another person’s good time\n",
            "exercise":"\nAsk yourself these three questions: \n1. Am I responsible for the outcome in this situation?\n2. Is there any other way to explain how things took place?\n3. Is there a shared responsibility for the negative outcome?\n"
        },
        {
            "name":"Catastrophizing",
            "intro":"\nDoes your thought assume the worst possible outcome?\n",
            "opening": "\nThis bias leads people to dread or assume the worst\nwhen faced with the unknown.\nWhen people catastrophize, ordinary worries can quickly escalate.\n",
            "example":"\nFor example: If I fail this test, I will never pass school,\nand I will be a total failure in life.\n",
            "affirmation":"\nGood catch. \nIts often easy to dismiss catastrophizing as a hysterical over-reaction\n",
            "explanation":"\nWhile there are several potential causes and contributors to catastrophizing,\nmost fall into one of three categories: \n1. Ambiguity or being vague can open a person up to catastrophic thinking.\n2. Relationships that a person holds in high value can result in a tendency to catastrophize.\n3. Fear, especially irrational fear, plays a big part in catastrophizing.\n",
            "exercise":"\nStopping catastrophizing is a two step process.\n1. Saying Stop! - To cease the repetitive, catastrophic thoughts,\nyou may have to say out loud “stop!” or “no more!”\n2. Thinking about another outcome: Instead of thinking about a negative outcome,\nconsider a positive one or even a less-negative option.\n"
        }
]
